DataFrame은 어떤 데이터를 처리하기 위한 것인가?
- 2차원의 데이터를 처리하기 위한 것.

DataFrame은 어떤 요소로 구성되는가?
- column 무조건 있어야 한다. Excel 관점) 첫 번째 열은 Index.

DataFrame과 Series의 차이는?
- DataFrame 중에서 특정한 하나의 열이 Series.

Dictionary를 이용하여 DataFrame을 만들 때 key와 value에 각각 어떤 값을 넣어야 하나?
- key에는 column명을 넣는다. value에는 Series를 넣으면 된다. DataFrame은 Series로 구성되어 있는데 열로 구성되어 있는 것이다. 열별로 value 갯수가 같아야 한다.

DataFrame의 행의 개수를 알고 싶다. 어떤 명령어를 사용해야 하나?
- .shape를 실행하면 된다. 튜플값으로 보여주는데, 행과 열을 알 수 있다. 행만 알고 싶으면 len()으로 처리하면 된다.

DataFrame의 요약통계값을 보고 싶다. 어떤 메소드를 써야하나?
- describe 메소드를 사용하면 된다. 숫자로 된 column만 나오게 된다. 문자로 되어 있는 column은 요약통계값이 나올 수 없다.

df.info() 메소드가 알려주는 정보는?
- column, column의 데이터타입, 결측값이 아닌 갯수도 보여줌. dtype. memory 사용량도 알려준다.

pandas의 데이터 타입에는 어떤 것이 있냐?
- 데이터타입 처리하는 게 가장 헷갈리다. 데이터 타입 : 기본데이터 타입, 콜렉션 데이터 타입이 있다. 기본데이터 타입 : 정수, 실수, 문자열, boolean형. 콜렉션 데이터 타입 : 리스트, 튜플 etc... 정수형, 실수형, 불, Object(날짜, 시간, timedelta, 카테고리 : 범주형이냐, 아니냐....) 수입은 연속형 범주형. 범주형 : 값간에 관계가 없다. 값간의 크기를 논할 수 없다.  데이터 타입 표를 항상 잊지 말고 봐야 한다.

pandas에서 데이터 타입을 바꾸려면 어떤 메소드를 사용해야 하나?
- .astype() 메소드를 사용해서 바꾸면 된다. 바꾸고 싶은 데이터 타입을 괄호 안에 쓰면 된다.

In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

<font color = "#CC3D3D"><p>
# Topics
* [Reading and Writing Data](#Reading-and-Writing-Data)
* [Creating and Deleting Columns](#Creating-and-Deleting-Columns)
* [Renaming Columns](#Renaming-Columns)
* [Removing Duplicate Rows](#Removing-Duplicate-Rows)
* [Sorting](#Sorting)

## Reading and Writing Data
<br>
<img align="left" src="http://drive.google.com/uc?export=view&id=1PQtlrD6iwmV9kp5uJrcSsLWpkYih9wGI" width=500 height=400>

그림을 이해하는 게 중요
read_* : *는 파일의 타입

In [2]:
exam = pd.read_csv('exam.csv')
exam

   ID  Exam1  Exam2  Quiz
0   1    3.3    2.0   3.7
1   2    4.0    4.0   4.0
2   3    2.3    0.0   3.3
3   4    2.2    1.0   3.3
4   5    3.1    1.2   3.9

In [3]:
exam.to_excel('exam.xlsx', index=False) # 주의할 점 : index=False로 해야 된다. 특별한 일이 아니면. 저장할 때 index를 빼고 저장해야 된다.
# index=True로 저장하게 되면 인덱스 부분까지 그대로 저장되게 된다. 나중에 읽으려면 하면 인덱스값까지 나오게 되며 column명은 없기 때문에 unname으로 나온다.
# 특별한 경우 아니면 무조건 index=False다. 계속 강조하신 부분!!!

In [7]:
%ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: E677-A9F5

 C:\Users\송한솔 디렉터리

2020-05-20  오후 03:38    <DIR>          .
2020-05-20  오후 03:38    <DIR>          ..
2020-03-22  오후 03:33    <DIR>          .android
2020-05-20  오후 03:04    <DIR>          .ipynb_checkpoints
2020-03-25  오후 02:50    <DIR>          .ipython
2020-03-26  오후 02:06    <DIR>          .jupyter
2020-05-16  오후 01:44    <DIR>          .matplotlib
2020-05-16  오후 01:43    <DIR>          .qgis2
2020-04-24  오후 02:41    <DIR>          __pycache__
2020-03-26  오후 02:11             2,555 0325 수업 노트 필기.ipynb
2020-05-16  오전 02:57    <DIR>          3D Objects
2020-05-06  오후 08:22             1,867 AP_0318_01(연습문제전용).ipynb
2020-05-08  오후 04:22            26,078 AP_0325_01(연습문제전용).ipynb
2020-05-06  오후 10:11            44,358 AP_0325_01.ipynb
2020-04-01  오후 02:49             5,802 AP_0325_ex.ipynb
2020-05-06  오후 08:22            29,545 AP_0401_01(연습문제전용).ipynb
2020-05-07  오후 04:04            59,359 AP_0401_01.ipynb
2020-05-06  오후 08:22            21,608 AP_0408_01(연습문제전용).ipynb
2020-05-08  오후 03:52           108,754 AP_0408_01.ipynb
2020-04-24  오후 05:19            70,467 AP_0422_01.ipynb
2020-05-08  오후 03:41            27,207 AP_0422_02(연습문제전용).ipynb
2020-05-08  오전 11:59            72,015 AP_0422_02.ipynb
2020-05-08  오후 07:51            27,476 AP_0429_01(연습문제전용).ipynb
2020-05-06  오후 10:11            64,821 AP_0429_01.ipynb
2020-05-20  오후 03:03           229,021 AP_0506_01.ipynb
2020-05-20  오후 03:38            18,932 AP_0513_01.ipynb
2020-05-20  오후 03:33            19,856 AP_0520_01.ipynb
2020-05-16  오전 02:57    <DIR>          Contacts
2020-03-22  오후 03:44               297 d4ac4633ebd6440fa397b84f1bc94a3c.7z
2020-05-06  오후 02:59           131,965 Demo.csv
2020-05-19  오후 06:49    <DIR>          Desktop
2020-05-16  오전 02:57    <DIR>          Documents
2020-05-20  오후 03:03    <DIR>          Downloads
2020-05-13  오후 02:57                84 exam.csv
2020-05-20  오후 03:40             5,544 exam.xlsx
2020-05-16  오전 02:57    <DIR>          Favorites
2020-02-26  오후 04:34                66 inittk.ini
2020-02-26  오후 04:34                41 inst.ini
2020-04-22  오후 05:14               104 kkk.py
2020-05-13  오후 01:23           214,593 line2_subway.qgs
2020-05-13  오후 01:23           215,986 line2_subway.qgs~
2020-05-16  오전 02:57    <DIR>          Links
2020-05-06  오후 02:59         1,545,051 movie.csv
2020-05-16  오전 02:57    <DIR>          Music
2020-04-24  오후 02:41               274 mymath.py
2020-02-26  오후 04:34    <DIR>          Nox_share
2020-02-26  오후 04:34                45 nuuid.ini
2020-04-08  오후 02:19            11,363 Obama_words.txt
2020-05-20  오후 02:55    <DIR>          OneDrive
2020-05-16  오전 02:57    <DIR>          Pictures
2020-05-13  오후 08:06            47,885 QGIS.qgs
2020-05-13  오후 08:06            49,553 QGIS.qgs~
2020-05-10  오후 05:00            46,383 QGIS_easy.qgs
2020-05-10  오후 04:16            93,505 QGIS_heatmap.qgs
2017-12-07  오후 12:52    <DIR>          Roaming
2020-05-16  오전 02:57    <DIR>          Saved Games
2020-05-16  오전 02:57    <DIR>          Searches
2020-02-26  오후 04:34                53 useruid.ini
2020-05-16  오전 02:57    <DIR>          Videos
2020-03-22  오후 03:33    <DIR>          vmlogs
2020-05-13  오후 01:43            58,828 과제_준비.qgs
2020-05-13  오후 01:43            58,828 과제_준비.qgs~
2020-05-06  오후 03:00         8,366,214 구매내역정보.csv
2020-03-24  오후 09:50    <DIR>          새 폴더
2020-05-05  오후 08:20           292,784 연습문제 풀이(21_24번).html
2020-05-05  오후 08:20           309,983 연습문제 풀이(5번 _ 20번).html
2020-05-08  오후 07:53             2,298 퀴즈답안지.ipynb
              41개 파일          12,281,448 바이트
              26개 디렉터리  36,970,946,560 바이트 남음

In [8]:
exam2 = pd.read_excel('exam.xlsx')
exam2

   Unnamed: 0  ID  Exam1  Exam2  Quiz
0           0   1    3.3    2.0   3.7
1           1   2    4.0    4.0   4.0
2           2   3    2.3    0.0   3.3
3           3   4    2.2    1.0   3.3
4           4   5    3.1    1.2   3.9

In [10]:
# 엑셀에서 일부 내용을 복사한 후 클립보드를 이용하여 읽을 수 있다.
exam3 = pd.read_clipboard()
exam3
# excel 작업하고 있으면서 표를 띄우면 엑셀 일부 영역만 파이썬에 띄우고 쓰고 싶을 때가 있다. 그 때 사용. 많이 사용하는 기능은 아니다.

EmptyDataError: No columns to parse from file

In [9]:
exam2.query('(Exam2 >= 1) & (Quiz < 3.9)')

   Unnamed: 0  ID  Exam1  Exam2  Quiz
0           0   1    3.3    2.0   3.7
3           3   4    2.2    1.0   3.3

In [11]:
examf = exam.iloc[[4,0],:]
examf

   ID  Exam1  Exam2  Quiz
4   5    3.1    1.2   3.9
0   1    3.3    2.0   3.7

In [12]:
examf.to_csv('examf.csv', index=False)

In [13]:
%ls examf.csv

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: E677-A9F5

 C:\Users\송한솔 디렉터리

2020-05-20  오후 03:48                51 examf.csv
               1개 파일                  51 바이트
               0개 디렉터리  36,973,506,560 바이트 남음

In [4]:
# 아래에서 다루는 pandas 기능을 실제 데이터에 적용하기 위해
movie = pd.read_csv('movie.csv')
demo = pd.read_csv('Demo.csv', encoding='cp949')
tran = pd.read_csv('구매내역정보.csv', encoding='cp949', engine='python')

## Creating and Deleting Columns

In [5]:
data = {'state': ['서울', '서울', '서울', '부산', '부산', '부산'],
        'year': [2014, 2016, 2018, 2014, 2016, 2018],
        'pop': [997.5, 984.3, 970.5, 345.2, 344.7, 340.0]}
df = DataFrame(data)
df

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [16]:
# south라는 이름의 컬럼을 생성

df['south'] = df.state.isin(['부산', '경남'])
df

  state  year    pop  south
0    서울  2014  997.5  False
1    서울  2016  984.3  False
2    서울  2018  970.5  False
3    부산  2014  345.2   True
4    부산  2016  344.7   True
5    부산  2018  340.0   True

In [17]:
# eastern 컬럼 삭제: 방법1

df.drop('south', axis=1)
# df = df.drop('south', axis=1)

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [18]:
# eastern 컬럼 삭제: 방법2
# axis = 0 행, axis = 1 열
df.drop('south', axis=1, inplace=True) # inplace=True는 df에 자동적으로 assign한다.
# df2 = df2.drop('south', axis=1)
# del df2['south'] 이렇게 사용해도 된다.
df

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [19]:
df

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [21]:
df['pop'] > 500

# 참이기도하고 거짓이기도 하다. 참,거짓 판단할 수 없다.

0     True
1     True
2     True
3    False
4    False
5    False
Name: pop, dtype: bool

<font color='blue'>
아래와 같은 조건에 따라 값이 채워지는 새로운 필드 'pop2'를 만들려고 한다. (이 예제는 굉장히 중요한 내용!!!)<br>
if pop > 2 then pop2 = pop + 2, else pop2 = pop + 1.5

In [20]:
# 아래와 같이 코딩하면 오류가 발생한다!!!

if df['pop'] > 500:
    df['pop2'] = df['pop'] + 2
else:
    df['pop2'] = df['pop'] + 1.5
    
# ValueError : The truth value of a Series is ambiguous. 참 거짓이 모호하다.

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [22]:
# 그 이유: Series 타입 변수의 연산은 element-wise이기 때문.

df['pop'] > 2

0    True
1    True
2    True
3    True
4    True
5    True
Name: pop, dtype: bool

In [24]:
# 해결방법: 먼저 아래와 같은 함수를 만든 후,
def f(x) :    
    return x + 2 if x > 500 else x + 1.5

In [25]:
# Series의 apply 메소드를 사용하여 위 함수를 Series의 각 element에 적용한다.
# 얼마 전에 배운 map함수와 유사

df['pop2'] = df['pop'].apply(f)
df

# .apply메소드 : pop이라는 시리즈 원소에서 하나씩 뽑아서 f에 적용한다. map과 개념이 비슷하다.

  state  year    pop   pop2
0    서울  2014  997.5  999.5
1    서울  2016  984.3  986.3
2    서울  2018  970.5  972.5
3    부산  2014  345.2  346.7
4    부산  2016  344.7  346.2
5    부산  2018  340.0  341.5

In [28]:
x = [1,2,3,4,5]
Series(x).apply(lambda x: np.sqrt(x))

0    1.000000
1    1.414214
2    1.732051
3    2.000000
4    2.236068
dtype: float64

In [29]:
# 위 해결방법이 이해가 되지 않으면, np.where()라는 numpy에서 제공하는 함수를 쓰면된다.
# 이 함수는 excel의 IF()함수와 사용법이 같다.
# 밑의 코드랑 현재 식이랑 같다. 중요한 것!
df['pop2'] = np.where(df['pop'] > 500, df['pop'] + 2, df['pop'] + 1.5)
df

  state  year    pop   pop2
0    서울  2014  997.5  999.5
1    서울  2016  984.3  986.3
2    서울  2018  970.5  972.5
3    부산  2014  345.2  346.7
4    부산  2016  344.7  346.2
5    부산  2018  340.0  341.5

In [30]:
# lambda 함수를 사용할 줄 아는 사람은 아래와 같이 깔끔하게 코딩토록 하자.
# 이해가 되지 않으면 지금은 그냥 무시해도 된다.

df['pop2'] = df['pop'].apply(lambda x: x + 2 if x > 500 else x + 1.5)
df

  state  year    pop   pop2
0    서울  2014  997.5  999.5
1    서울  2016  984.3  986.3
2    서울  2018  970.5  972.5
3    부산  2014  345.2  346.7
4    부산  2016  344.7  346.2
5    부산  2018  340.0  341.5

## Renaming Columns

In [31]:
data = {'state': ['서울', '서울', '서울', '부산', '부산', '부산'],
        'year': [2014, 2016, 2018, 2014, 2016, 2018],
        'pop': [997.5, 984.3, 970.5, 345.2, 344.7, 340.0]}
df = DataFrame(data)
df

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [32]:
# rename을 column 뿐만아니라 index에도 적용할 수 있기 때문에 columns 파라미터가 필요하다는 걸 명심하자.
# dictonary 형식으로 진행하면 된다.
df.rename(columns = {'pop': '인구'})

  state  year     인구
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [33]:
df = df.rename(columns = {'pop': '인구', 'state': '광역시', 'year':'연도' })
df

  광역시    연도     인구
0  서울  2014  997.5
1  서울  2016  984.3
2  서울  2018  970.5
3  부산  2014  345.2
4  부산  2016  344.7
5  부산  2018  340.0

## Removing Duplicate Rows

In [34]:
df = DataFrame({'k1': ['one'] * 3 + ['two'] * 4,
                  'k2': [1, 1, 2, 3, 3, 4, 4]})
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [35]:
df.drop_duplicates() # 같은 값 사라짐.

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [36]:
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [37]:
df['v1'] = range(7)
df

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [38]:
df.drop_duplicates(['k1'])
# k1이 같으면 다 지워라. 그런 명령문의 코드 중복된 걸 지울 때 처음 것을 살린다.

    k1  k2  v1
0  one   1   0
3  two   3   3

<font color = 'blue'>Duplicated and drop_duplicates by default keep the first observed value combination. Passing *keep='last'* will return the last one:

In [39]:
df.drop_duplicates(['k1', 'k2'], keep='last') # 중복된 값 중 뒤에 있는 것을 유지시키고 앞에 있는 값을 지운다. default값은 keep='first'

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

## Sorting

In [40]:
df = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
df

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [41]:
df.sort_values(by='b') # sorting 할 column 기준이 b이다.

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

<font color = 'blue'>The data is sorted in ascending order by default, but can be sorted in descending order,too:

In [42]:
df.sort_values(by='b', ascending=False) # ascending = True : 내림차순, False = 오름차순

   b  a
1  7  1
0  4  0
3  2  1
2 -3  0

<font color = 'blue'>To sort by multiple columns, pass a list of names:

In [43]:
df.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

<font color = 'blue'>Ranking is closely related to sorting, assigning ranks from one through the number of valid data points in an array.

In [44]:
df.rank()

     b    a
0  3.0  1.5
1  4.0  3.5
2  1.0  1.5
3  2.0  3.5

In [45]:
df.rank(method = 'min')

     b    a
0  3.0  1.0
1  4.0  3.0
2  1.0  1.0
3  2.0  3.0

<font color = "#CC3D3D"><p>
# End